#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьЗначенияКонстант();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КодАвторизации(Команда)
	ПараметрыОткрытия = Новый Структура("IDПриложения", IDПриложения);
	ОткрытьФорму("ОбщаяФорма.ЯД_Авторизация", ПараметрыОткрытия, Элементы.КодАвторизации, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура Токен(Команда)
	ТокенНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыПриИзменении(Элемент)
	УстановитьЗначениеКонстанты(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьЗначенияКонстант()
	
	ЯД_Токен = Константы.ЯД_Токен.Получить();
	ЯД_IDПриложения = Константы.ЯД_IDПриложения.Получить();
	ЯД_ПарольПриложения = Константы.ЯД_ПарольПриложения.Получить();
	ЯД_КодАвторизации = Константы.ЯД_КодАвторизации.Получить();
	ЯД_СрокДействияТокена = Константы.ЯД_СрокДействияТокена.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ТокенНаСервере()
	
	ЯндексДискОбменДанными.Токен();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, ЗначениеКонстанты)
	Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);
КонецПроцедуры

#КонецОбласти
